app/controllers/api/places_controller.rb

SELECT  "places".* FROM "places"  WHERE "places"."id" = $1 LIMIT 1  [["id", 0]]
---
    def show
      begin
        @place = Place.find(params[:id])